app/views/tweets/index.html.erb

                    <%= link_to tweet_like_path(id: t.id, tweet_id: t.id), method: :delete do %>
                      <i class="fas fa-heart"></i><%= t.likes.count %>
---
SELECT COUNT(*) FROM `likes` WHERE `likes`.`tweet_id` = 5

                    <%= link_to tweet_likes_path(id: t.id, tweet_id: t.id), method: :post do %>
                        <i class="fas fa-heart"></i><%= t.likes.count %>
---
SELECT COUNT(*) FROM `likes` WHERE `likes`.`tweet_id` = 5

              <% else %>
                <i class="fas fa-heart"></i><%= t.likes.count %>
---
SELECT COUNT(*) FROM `likes` WHERE `likes`.`tweet_id` = 14