app/views/tweets/show.html.erb

              <%= link_to tweet_like_path(@tweet), method: :delete do %>
                  <i class="fas fa-heart"></i><%= @tweet.likes.count %>
---
SELECT COUNT(*) FROM `likes` WHERE `likes`.`tweet_id` = 1

              <%= link_to tweet_likes_path(@tweet), method: :post do %>
                  <i class="fas fa-heart"></i><%= @tweet.likes.count %>
---
SELECT COUNT(*) FROM `likes` WHERE `likes`.`tweet_id` = 14

        <% else %>
            <i class="far fa-heart"></i><%= @tweet.likes.count %>
---
SELECT COUNT(*) FROM `likes` WHERE `likes`.`tweet_id` = 14

          <div>
            <%= c.user.name unless c.user.blank? %>
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1