app/controllers/comments_controller.rb

SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 5 LIMIT 1
INSERT INTO `comments` (`content`, `user_id`, `tweet_id`, `created_at`, `updated_at`) VALUES ('え', 1, 5, '2020-11-18 05:43:32.328754', '2020-11-18 05:43:32.328754')
---
    def create
      tweet = Tweet.find(params[:tweet_id])
      comment = tweet.comments.build(comment_params)
      comment.user_id = current_user.id
      if comment.save