app/controllers/likes_controller.rb

    def create
        @sending_user = User.find(current_user.id)
        @receiving_user = User.find(params[:user_id])
        like = current_user.likes.create(tweet_id: params[:tweet_id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1
INSERT INTO `likes` (`tweet_id`, `user_id`, `created_at`, `updated_at`) VALUES (5, 1, '2020-11-16 21:00:57.426088', '2020-11-16 21:00:57.426088')

    def destroy
        like = Like.find_by(tweet_id: params[:tweet_id], user_id: current_user.id)
        like.destroy
---
SELECT `likes`.* FROM `likes` WHERE `likes`.`tweet_id` = 5 AND `likes`.`user_id` = 1 LIMIT 1
DELETE FROM `likes` WHERE `likes`.`id` = 5