app/controllers/tweets_controller.rb

SELECT `tweets`.* FROM `tweets` WHERE (body LIKE '%湯船%' )
---
    def index
      if params[:search] == nil
        @tweets= Tweet.all

INSERT INTO `tweets` (`body`, `created_at`, `updated_at`, `image`, `user_id`) VALUES ('朝活なう', '2020-11-20 20:57:45.866421', '2020-11-20 20:57:45.866421', 'くつ.png', 1)
---
    def create
      tweet = Tweet.new(tweet_params)
      tweet.user_id = current_user.id

      if tweet.save

SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 5 LIMIT 1
---
    def show
      @tweet = Tweet.find(params[:id])

SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 7 LIMIT 1
DELETE FROM `tweets` WHERE `tweets`.`id` = 7
---
    def destroy
      tweet = Tweet.find(params[:id])
      tweet.destroy